# "Мамы разные нужны, мамы разные важны!"

### Эта история участвует в [конкурсе](http://mystory.hexlet.io/) от [Хекслета](https://ru.hexlet.io/). Если вам понравилось — посетите [мой репозиторий](https://github.com/Hexlet/our-stories) и поставьте Star в верхнем правом углу. Спасибо!

---
Моя история до боли банальна! Три года назад, уйдя
 во второй декрет, и мысли не было о смене профессии. На то момент моя работа мне нравилась. 
Я, как большинство мамаш, ждала места в садике, чтоб вернуться на работу и вновь зажить 
офисной жизнью... 
Но... Год назад ребенка вывели на инвалидность, что подразумевает частые походы по
 больницам... И я сразу стала очень "неудобным" сотрудником. В таких ситуациях у многих 
компаний вдруг резко начинаются финансовые трудности и сокращения. 
В общем меня благополучно сократили.
Пол года поиска новой работы закончились фразой: "Мы вам перезвоним!"
Потом на просторах интернета начался мой поиск удалённой работы! Много чего перепробовала. 
Ну не моё... Но идея заработка из дома меня не отпускала, ведь это, можно сказать, мой
 единственный вариант самореализации.
И как-то наткнулась на вакансию Верстальщик. Кто такой, что такое? Начала разбираться... 
Пересмотрев кучу видео уроков на Ютубе, поняла, что в голове полная каша, но при этом всё 
очень интересно! И, чтоб не бултыхаться в огромном количестве информации, стала искать курсы!
Нужны курсы... А как выбрать? Последовательные и доходчивые курсы. 
В одной из групп в ВК мне посоветовали Хекслет.
И вот: я с Хекслет, который поворачивает мозги в нужное направление, заставляя их работать и 
помогая не унывать, если не получается!
На данный момент я прохожу введение в программирование и понимаю, что мне ещё бесконечно 
много чего предстоит изучить.
Но уже сейчас сделала для себя вывод: хочу стать веб-разработчиком...
И буду двигаться в этом направлении дальше...
Нет худа, без добра...если бы не печальные семейные обстоятельства, я бы не открыла для себя 
новый мир программирования, а была бы просто офисным работником...
Ни капли не жалею, что меня сократили, даже наоборот...
Сейчас большую часть времени суток занимает обучение. Что-то очень туго доходит, далеко не 
всё сразу получается! Но когда начинает получаться- прям кайф, непередаваемые ощущения.

Хекслет, спасибо за создание такого образовательного портала! Вперёд!

**https://github.com/Zelenina33/our-stories/blob/master/stories/Zelenina33.md**

---

### Эта история участвует в [конкурсе](http://mystory.hexlet.io/) от [Хекслета](https://ru.hexlet.io/). Если вам понравилось — посетите [мой репозиторий](https://github.com/Hexlet/our-stories) и поставьте Star в верхнем правом углу. Спасибо!
