**Как я пришел к программированию** 

Hello, World! 
Вот моя история. 
 
В жизни каждого человека бывают такие моменты, которые определяют всю его дальнейшую судьбу. 
 
Я отчетливо помню тот день, который определил мою. Это случилось на уроке информатики. Мы осваивали Бэйсик. У него есть  режим screen, позволяющий делать простенькие рисунки с помощью команд. Это как современные SVG. Забиваешь координаты точек, линий, окружностей, потом запускаешь, и на экране появляется домик с окошками и трубой. 
 
Еще в Бэйсике есть функция read() - она обрабатывает ввод данных с клавиатуры в рантайме. Если вставить эту функцию в код, то на экране возле домика замигает курсор, ожидая пользовательского ввода. И вот у меня родилась идея.  А что, если в эту строку вводить некоторые данные, которые бы обрабатывались программой и воспринимались как команды, выполняя на лету соответствующие функции?  
 
``Нарисовать линию 100 100 400 100`` 
 
Я подошел с этим к учителю и он сказал, что это невозможно. 
Но я не поверил этому. Надо мною лампочка загорелась, как идея фикс, я как Нео почувствовал, что что-то изменилось. 
 
И я оказался прав. И хоть реализовать полноценно Paint не удалось, линии у меня  рисовались отменные. 
 
Это было в 5 классе. Но школьную программу вскоре поменяли, выкинув из информатики программирование. Дома компьютера тогда еще не было. Я пару раз ездил на олимпиады, но сильно там не выделялся. Так прошла школа. 
 
У некоторых людей есть четкая цель в жизни. Они говорят - мы хотим стать космонавтами, пожарными, военными. И хоть большинство из них все равно становится таксистами, строителями и продавцами, я им завидую - у них есть мечта. 
 
На момент поступления в универ я не знал чего хочу от жизни. Профессию выбирал почти спонтанно. В конечном итоге поступил в местный педагогический университет, матфак, прикладная информатика в экономике. Там не было особого упора на программирование, но универу я обязан многим. 
 
Среди прочего я познакомился с такими штуками как ассемблер, сети, логика, базы данных. Но это, может быть, не имело бы такой ценности, если бы опять таки не случай. 
 
Если вы добираетесь куда-нибудь на маршрутке, внимательно осмотрите свой билет. Если в нем сумма первых трех цифр равно сумме остальных трех, то вас можно поздравить - билет счастливый. Загадывайте желание, оно сбудется. 
 
Я часто езжу на общественном транспорте, у меня таких билетов много. А сколько их может быть максимально? Мы решали эту задачу на паре информатике. Решение “в лоб” простое - перебор и проверка всех билетов от 000 001 до 999 999.
Но нельзя ли эту задачу решить более оптимально? 
 
Я посмотрел на эти числа, как они меняются.. И у меня возникла идея. А что, если перебирать не миллион шестизначных чисел, а в тысячу раз меньше - только одну половину номера билета, применяя на каждом шаге некоторую функцию для просчета комбинаций?  
 
Я подошел с этим к преподавателю, и он сказал, что это и есть оптимальное решение. И мы вместе накидали решение этой задачи на доске.  
Тогда моя лампочка загорелась опять. Она и до сих пор светит мне оттуда. В тот день я впервые подумал, что программирование - это мое. 
 
Годы летели быстро. Моей дипломной работой было приложение, на основе статистических данных продукта прогнозирующее его конкурентоспособность. Оно не было способно выжить в реальном мире, но на критерии дипломной отвечало отлично. Жаль, что нельзя вернуться в то время. Со знаниями, что сейчас, можно было бы в сотворить что-нибудь удивительное. 
 
В городе, в котором я живу 120 тыс. человек. Если сейчас открыть hh, там по IT будет 24 вакансии. Из них 4шт - менеджер по продажам, 10шт - 1С, один оператор станка ЧПУ, несколько удаленок. Кроме того, тогда я не был готов к переезду. В общем, после универа я успешно устроился работать в автосервис. Потом сборщиком мебели. Потом грузчиком на приемку металлолома. 
 
Сферы деятельности сменяли друг друга, и я заметил одну любопытную вещь. Работая в местах, не пересекающихся с программированием, я все равно получал навыки, пригодившиеся мне впоследствии в программировании. Не смогу объяснить это более понятно, извините. 
 
Однажды я попал работать в веб-студию, но через месяц я оттуда убежал. Я не знал тогда, как правильно делать сайты, но понял одно - точно не так, как делали там. 
Были тогда в городе и хорошие компании. Но им я оказался не нужен. 
 
В конечном итоге судьба занесла меня в местный техникум. Я устроился программистом. Под программированием в техникуме понимали работу в разных программах - ворд, эксель. Основная часть работы сводилась к обработке министерских писем, составлению отчетов итд. Меня воротило от всего этого, но были и интересные задачи. Например в техникуме я подружился с Mikrotik и локальной сетью. Научился держать паяльник в руках. В общем, я работал эникейщиком. 
 
В это время я активно стал заниматься саморазвитием. Тогда я впервые познакомился с Хекслет. У них в то время обкатывалась новая фича, и я как тестировщик попал на бесплатного ментора. Это было крутое время. Я приходил на работу в техникум, и создавая видимость работы, проходил PHP-стэк, решал задачи, пыхтел как паровоз. 
 
На Хекслете особый подход к обучению. Мне запомнился один комментарий сооснователя на решение одной задачи какого-то парня. Среди прочего он писал - **Вы не должны хотеть этого.** То есть сам образ мышления должен быть другим. И многие после прохождения курса писали, что в голове все словно переворачивается вверх дном. 
 
Я прошел почти всю профессию бэкенд разработчика и вновь пытался устроиться в IT, теперь уже на удаленку. Я слал резюме, звонил HR-агентам, проходил собеседования.  
Но где-то я не справлялся, где-то справлялся, но не хватало английского, где-то всего хватало, но находились ребята лучше меня. Отказы больно били по самолюбию, и я понял, что нужно что-то менять. Тогда было решено понизить порог вхождения.  
 
Верстка в принципе довольно приятная штука. Она спокойная, понятная. Я отдыхаю, когда занимаюсь этим. Правда вкладывать душу в конвейер по производству сайтов мне, не особо хотелось, но я решил не сдаваться. Дальше была Html Academy, курсы, интенсивы, макеты. 
 
К тому времени у нас в семье родилась дочь, и в связи с этим я пошел на вторую работу в охрану. Это военная часть и все по-серьезному, но если аккуратно, то можно с собой прихватить некоторые посторонние предметы. И вот однажды на смене я ковырялся с какой-то задачкой. Была ночь и зима. На вышке минус. И я на минуту прикрыл нетбук, посмотрел на себя со стороны, на все то, что я здесь вам написал, и сказал сам себе - ты либо дурак, либо программист. 
 
Кстати, именно тогда я по-настоящему научился слепой печати. 
 
Взирая на прожитые годы могу сказать, что было всякое. Взлеты, падения сменяли друг друга раз за разом. Были сомнения типа - может это все-таки не твое, может это ошибка, и нужно все оставить и идти засевать огород картошкой и разводить куриц? Тогда я спрашивал себя, каким делом  смог бы заниматься безвозмездно, только потому, что оно нравится само по себе? И перебирая все профессии я пришел к выводу, что программирование - это мое. 

Через некоторое время я попал на очередное собеседование. Прокат велосипедов, нужен человек, способный разработать веб-приложение для трека проката. Хозяин сам в прошлом программист, безопасник. ЗП маленькая. И я согласился, и меня взяли. 
 
На момент написания всего этого я получил на этом месте  уже четвертую зарплату. Чувствуете? Я зарабатываю на жизнь программированием. Я программист! 
 
Работая единственным разработчиком в команде, обладаешь повышеной свободой выбора. Серверную часть я пишу на PHP,  фронт на Vue.js. Работаю удаленно, раз в неделю захожу в офис. Недавно мое приложение вышло в продакшн, и оно работает. Это очень льстит. Конечно, знаний не хватает, поэтому я вновь стал учиться. Здравствуй, Хекслет! 
 
Не знаю насколько продолжительным будет этот этап в моей жизни, не знаю как повернется дальше. Мне бы хотелось чего-то более серьезного, работы в команде, пулл-реквестов, мозговых штурмов. Не собираюсь останавливаться на достигнутом. Думаю, что это только очередная ступенька. 
 
Выводы. 
Никогда не сдавайтесь. Не течет вода под лежачий камень. Она вообще плохо течет. Если не получается, отложите и подойдите с другой стороны. Верьте в себя. 
 
**Просите, и дано будет вам. Ищите, и найдете. Стучите, и отворят вам (с)**
