# Где-то 7 лет назад!

Небольшая история о том, как я иду к тому, чтобы стать профессиональным Frontend-разработчиком.

### Эта история участвует в [конкурсе](http://mystory.hexlet.io/) от [Хекслета](https://ru.hexlet.io/). Если вам понравилось — посетите [мой репозиторий](https://github.com/ZoomieOS/our-stories/our-stories/zoomieos.md) и поставьте Star в верхнем правом углу. Спасибо!

---
Здравствуйте, меня зовут -- Олег я из города Минска. Где-то 7 лет назад, у меня появился компьютер, а затем желание копаться в нём, подключать, отключать
разбирать, всё-всё, что можно было сделать. Мне это нравилось, я чувствовал к этому увлечение. Позже мне подключили интернет, и вот тут началась история к 
программированию

## Мой первый опыт в оздании сайта

Где-то уже в году 2011, я задумался, а как создавать сайты, на чём создавать сайты, что это вообще такое? И я начал изучать информацию в интернете.
Наткнулся на один сайт (http://skripter.info/) и я там познакомился со многими ребятами, узнал что такое хостинг, CMS, доменное имя, как привязывать и т.д
Мой первый сайт был на реселлере, какой-то чувак, продавал сайты на его хостинге, и я такой думаю, надо попробовать, на то время, я накопил 16 000 бел.руб
на рос.деньги это где-то (60 коп.). На то время очень популярными были трекеры, варезы. И я начал создавать 'Варезник' -- сайт, как медиа ресурс определённый.
был на поддомене iam.by и назывался multi-guest.iam.by, первая моя CMS система была DLE, для меня тогда была дико удобная, и порого вхождения, очень низкий.
Взял накинул шаблон в Photoshop и натянул на сайт.(Ах! Да! Тогда я ещё парллельно начал изучать ФШ, и анимацию в ФШ). Было всё хорошо с сайтом, пока его не закрыли
за продажу прокси. И на этом моя история с сайтами, временно прекратилась.

## Вторая попытка, но более серьёзная.

Вторая попытка создания сайта, была со своего сервера, я тогда уже знал некоторых ребят в байнете, и с одним из них, сидя в TeamSpeak. Решили снова попробовать,
а вдруг что получится. Мы наскребли денег, и арендовали VPS на linux, это был мой первый опыт с командной строкой, и вообще с пингивном. И я накатил туда LAMP.
привязал домен, и всё заработало, теперь осталось домен и дизайн, купили домен, сначала на free-portal.of.by но потом когда выросли, апнули до free-poral.by
Тем временем, я продалжал изчение HTML, CSS, PHP и тогда я узнал о библиотеке jQuery, но не задумывался, что это к JS. Позже я начал ставить сервера игровые, набирался
опыта в администрировании сервера. Через какое-то время наша команда распалась и проект пришлось увезти в инактив. Кто знает, может ещё возобновит своё существование.

## Создание соц.сети

У меня уже есть знания определённые, и я подумал, дуров создал же соц сеть, а почему я не могу?! В итоге я взял движок Social Engine
И начал пилить под старый контакт, там были подарки, голоса, вообще удовлетворил себя, что я был админом соц.сети. Писал свои первые какие-то плагины
и выкатывал его. В социальной сети было человек, постоянно, где-то 20-35. И все они вроде бы как общались. Но в дальнейшем, я не мог её оформить, так как завно в РБ
требует чтобы регистрировали соц. сети. Тогда я ушёл на перерыв

## Первая работа после перерыва.

Скажу так, что начал искать работу, и подвернулась мне 'Разработчик WordPress', и я согласился, хоть серьёзного опыта я не имел. Создал сайт на CMS
beleksprint.by . Просили использовать PageBuilde'r, что я и сделал, натягивал шаблон, потом писал какие-то плагины на PHP, незначительные. Проработав и 
сделав несколько проектов, я уволился и пошёл на такую же позицию, только уже к серьезным людям. Повысил свои скиллы в CSS, HMTL, JS, PHP.
Налепав сайтов где-то 3-4 с поддержкой,  ушёл с этой компании.

## В настоящее время

Я не упомянул, что в этом промежутке, я проходил какие-то курс онлайн HMTLAcademy, codeacademy, freecodecamp и hexlet.
Хочу заняться фронтенд, ибо мне это интересно. Я готов проводить за материалом для изучения, часы, а ели и понадобится, то и дни. Могу писать код, часами
дебажить. Но было бы неплохо, если бы я выиграл обучение на Хекслет, с ментором и своими проектами, чтобы не стыдно было показать портфолио.
Надеюсь вам понравился мой рассказ, вы оцените его по достоинству.


ОПЦИОНАЛЬНО: ссылки на сайты или ваши профили в соц. сетях.
- [Сайт типографии](http://beleksprint.by)
- [Сайт добавок](http://euroin.by)
- [http://tik](http://tikitour.by)

**Здесь должна быть обязательная ссылка на ваш файл в вашем форке вида https://github.com/Hexlet-Source/our-stories/blob/master/stories/zoomieos.md**

---

### Эта история участвует в [конкурсе](http://mystory.hexlet.io/) от [Хекслета](https://ru.hexlet.io/). Если вам понравилось — посетите [мой репозиторий](https://github.com/ZoomieOS/our-stories/our-stories/zoomieos.md) и поставьте Star в верхнем правом углу. Спасибо!
